example/query/Poll_event_sensor_specific/EQ_stringValue.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:query="urn:epcglobal:epcis-query:xsd:1" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soapenv:Header/>
    <soapenv:Body>
        <query:Poll>
            <queryName>SimpleEventQuery</queryName>
            <params>
                <param>
                    <name>EQ_stringValue</name>
                    <value xsi:type="xsd:string">SomeString</value>
                </param>
            </params>
        </query:Poll>
    </soapenv:Body>
</soapenv:Envelope>